frolic/pocket-pet/device/sdkconfig.defaults
# Values proven by the Waveshare 02_lvgl_demo_v9 example on this board.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# CONFIG_SPIRAM_SPEED_80M is not set
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_FREERTOS_HZ=1000

# Keep the LVGL draw buffer in internal SRAM: PSRAM draw buffers tear when
# the wifi stack contends for PSRAM bandwidth (ghost frames, banding).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=65536
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=60
CONFIG_GDMA_ISR_IRAM_SAFE=y
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y

CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

CONFIG_PM_ENABLE=y
# CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR is not set
CONFIG_LV_USE_SNAPSHOT=y

# Light sleep is MANUAL (device_sleep.c), never tickless-automatic: tickless
# idle measurably degrades the SPI flush pipeline on this board (~3-5 dropped
# panel flushes/second while rendering, A/B-verified over serial), which was
# the "light tearing" of the first auto-light-sleep attempt.
# CONFIG_FREERTOS_USE_TICKLESS_IDLE is not set

# CRITICAL: ESP_SLEEP_GPIO_RESET_WORKAROUND must stay OFF. Its startup hook
# (esp_sleep_startup_init) arms hardware sleep-sel isolation on EVERY digital
# pad — QSPI panel bus, I2C, GPIO13 — so any light sleep entry floats them
# all and latches the CO5300 panel into persistent corruption (the
# frozen-display failure of the second auto-light-sleep attempt). Cost of
# disabling: a >6V ESD pulse on an input pad during light sleep can reset the
# chip — visible and recoverable, unlike the panel latch.
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
